sysbench/oltp_point_select_flexible_raft.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 3241.45 qps: 3241.45 (r/w/o: 3241.45/0.00/0.00) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 4369.99 qps: 4369.99 (r/w/o: 4369.99/0.00/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 6014.03 qps: 6014.03 (r/w/o: 6014.03/0.00/0.00) lat (ms,99%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 4933.64 qps: 4933.64 (r/w/o: 4933.64/0.00/0.00) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 7416.57 qps: 7416.57 (r/w/o: 7416.57/0.00/0.00) lat (ms,99%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 7576.19 qps: 7576.19 (r/w/o: 7576.19/0.00/0.00) lat (ms,99%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 7936.70 qps: 7936.70 (r/w/o: 7936.70/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 7766.06 qps: 7766.06 (r/w/o: 7766.06/0.00/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 7696.54 qps: 7696.54 (r/w/o: 7696.54/0.00/0.00) lat (ms,99%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 7935.34 qps: 7935.34 (r/w/o: 7935.34/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
       1.227 |                                         1
       1.392 |                                         1
       1.417 |                                         1
       1.443 |                                         1
       1.469 |                                         2
       1.496 |                                         3
       1.523 |                                         3
       1.551 |                                         4
       1.579 |                                         1
       1.608 |                                         9
       1.637 |                                         12
       1.667 |                                         13
       1.697 |                                         21
       1.728 |                                         27
       1.759 |                                         35
       1.791 |                                         51
       1.824 |                                         57
       1.857 |                                         84
       1.891 |                                         86
       1.925 |                                         124
       1.960 |                                         164
       1.996 |                                         210
       2.032 |*                                        257
       2.069 |*                                        362
       2.106 |*                                        413
       2.145 |*                                        511
       2.184 |*                                        599
       2.223 |**                                       777
       2.264 |**                                       905
       2.305 |**                                       1139
       2.347 |***                                      1304
       2.389 |***                                      1543
       2.433 |****                                     1792
       2.477 |*****                                    2102
       2.522 |*****                                    2484
       2.568 |******                                   2901
       2.615 |*******                                  3312
       2.662 |********                                 3787
       2.710 |**********                               4427
       2.760 |***********                              5126
       2.810 |************                             5667
       2.861 |**************                           6285
       2.913 |***************                          7140
       2.966 |*****************                        7787
       3.020 |*******************                      8735
       3.075 |********************                     9392
       3.130 |***********************                  10394
       3.187 |************************                 11212
       3.245 |**************************               12216
       3.304 |*****************************            13361
       3.364 |******************************           14083
       3.425 |*********************************        15111
       3.488 |**********************************       15674
       3.551 |***********************************      16170
       3.615 |*************************************    17109
       3.681 |**************************************   17473
       3.748 |**************************************   17641
       3.816 |***************************************  18215
       3.885 |**************************************** 18475
       3.956 |**************************************** 18261
       4.028 |**************************************** 18342
       4.101 |**************************************** 18287
       4.176 |**************************************   17593
       4.252 |**************************************   17705
       4.329 |*************************************    16880
       4.407 |***********************************      16231
       4.487 |**********************************       15844
       4.569 |********************************         14899
       4.652 |*******************************          14361
       4.737 |******************************           13720
       4.823 |***************************              12677
       4.910 |***************************              12309
       4.999 |*************************                11559
       5.090 |************************                 11015
       5.183 |***********************                  10481
       5.277 |*********************                    9528
       5.373 |*******************                      8913
       5.470 |*****************                        7981
       5.570 |****************                         7603
       5.671 |***************                          7064
       5.774 |**************                           6657
       5.879 |*************                            6222
       5.986 |************                             5666
       6.095 |***********                              5306
       6.205 |**********                               4836
       6.318 |**********                               4699
       6.433 |*********                                4114
       6.550 |********                                 3834
       6.669 |********                                 3716
       6.790 |*******                                  3421
       6.913 |*******                                  3104
       7.039 |******                                   2923
       7.167 |******                                   2733
       7.297 |*****                                    2504
       7.430 |*****                                    2258
       7.565 |*****                                    2096
       7.702 |****                                     1903
       7.842 |****                                     1898
       7.985 |***                                      1578
       8.130 |***                                      1520
       8.277 |***                                      1421
       8.428 |***                                      1317
       8.581 |***                                      1207
       8.737 |**                                       1118
       8.895 |**                                       1056
       9.057 |**                                       977
       9.222 |**                                       904
       9.389 |**                                       858
       9.560 |**                                       738
       9.734 |**                                       718
       9.910 |*                                        677
      10.090 |*                                        573
      10.274 |*                                        593
      10.460 |*                                        568
      10.651 |*                                        512
      10.844 |*                                        461
      11.041 |*                                        404
      11.242 |*                                        392
      11.446 |*                                        309
      11.654 |*                                        294
      11.866 |*                                        306
      12.081 |*                                        297
      12.301 |*                                        283
      12.524 |*                                        286
      12.752 |*                                        255
      12.984 |                                         201
      13.219 |                                         225
      13.460 |                                         208
      13.704 |                                         208
      13.953 |                                         148
      14.207 |                                         144
      14.465 |                                         137
      14.728 |                                         150
      14.995 |                                         119
      15.268 |                                         125
      15.545 |                                         122
      15.828 |                                         115
      16.115 |                                         83
      16.408 |                                         67
      16.706 |                                         88
      17.010 |                                         66
      17.319 |                                         47
      17.633 |                                         37
      17.954 |                                         51
      18.280 |                                         57
      18.612 |                                         43
      18.950 |                                         56
      19.295 |                                         41
      19.645 |                                         27
      20.002 |                                         34
      20.366 |                                         40
      20.736 |                                         20
      21.112 |                                         22
      21.496 |                                         25
      21.886 |                                         29
      22.284 |                                         17
      22.689 |                                         21
      23.101 |                                         13
      23.521 |                                         9
      23.948 |                                         11
      24.384 |                                         12
      24.827 |                                         14
      25.278 |                                         17
      25.737 |                                         11
      26.205 |                                         2
      26.681 |                                         3
      27.165 |                                         10
      27.659 |                                         12
      28.162 |                                         6
      28.673 |                                         6
      29.194 |                                         10
      29.725 |                                         16
      30.265 |                                         3
      30.815 |                                         8
      31.375 |                                         9
      31.945 |                                         16
      32.525 |                                         13
      33.116 |                                         8
      33.718 |                                         3
      34.330 |                                         1
      37.565 |                                         1
      38.247 |                                         3
      41.104 |                                         1
      43.385 |                                         5
      44.173 |                                         7
      46.625 |                                         1
      47.472 |                                         1
      48.335 |                                         4
      49.213 |                                         8
     127.805 |                                         1
     147.608 |                                         4
     150.290 |                                         5
     153.021 |                                         15
     314.453 |                                         24
     320.167 |                                         4
     325.984 |                                         1
     344.078 |                                         13
     350.330 |                                         18
     356.695 |                                         10
     434.829 |                                         1
     502.204 |                                         20
     511.328 |                                         4
     530.078 |                                         3
     539.710 |                                         30
     612.211 |                                         1
     623.335 |                                         2
     682.059 |                                         13
     694.452 |                                         1
     773.683 |                                         1
     943.158 |                                         1
     960.295 |                                         16
     977.743 |                                         18
    1013.597 |                                         5
    1032.013 |                                         24
    1069.856 |                                         1
    1089.295 |                                         1
    1109.087 |                                         24
    1258.076 |                                         1
    1280.934 |                                         1
    1327.905 |                                         1
    1352.033 |                                         1
    1427.078 |                                         14
    1506.288 |                                         1
    1533.657 |                                         1
    1618.783 |                                         14
    2045.740 |                                         1
    2120.756 |                                         1
    2159.289 |                                         7
    2449.355 |                                         1
    2493.859 |                                         1
    2585.308 |                                         1
    2828.869 |                                         2
    2932.602 |                                         1
    3040.139 |                                         7
    3095.377 |                                         7
    9624.589 |                                         1
 
SQL statistics:
    queries performed:
        read:                            648898
        write:                           0
        other:                           0
        total:                           648898
    transactions:                        648898 (6486.50 per sec.)
    queries:                             648898 (6486.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0367s
    total number of events:              648898

Latency (ms):
         min:                                    1.23
         avg:                                    4.92
         max:                                 9558.04
         99th percentile:                       10.84
         sum:                              3195598.04

Threads fairness:
    events (avg/stddev):           20278.0625/157.75
    execution time (avg/stddev):   99.8624/0.01